# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [30]:
# create a list of data
data1 = [4, 8, 15, 16, 23, 42]
pandas_series = pd.Series(data1)
pandas_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [42]:
# create a list of data
list1 = ['sunny', 'sandeep', 'jyothi', 'waseef', 'kiran', 'navya', 'swetha', 'rajesh', 'harish', 'kannaya']
New_series = pd.Series(list1)
New_series

0      sunny
1    sandeep
2     jyothi
3     waseef
4      kiran
5      navya
6     swetha
7     rajesh
8     harish
9    kannaya
dtype: object

# Q3. Create a Pandas DataFrame that contains the following data:

In [19]:
# create a dictionary of data
data = {'Name':['Alice','Bob','Claire'],
        'Age':[25, 30, 27],
       'Gender':['Female','Male','Female']}
dataframe = pd.DataFrame(data)
dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

**DataFrame** is a two-dimensional, size-mutable, and heterogeneous tabular data structure in pandas that can store data of different types in columns. It is the most commonly used data structure in pandas and can be thought of as a spreadsheet or SQL table. It provides a rich set of methods to manipulate, analyze, and transform the data.

In [26]:
# create a dictionary of data
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}

# create a DataFrame from the dictionary
df = pd.DataFrame(data)

In [25]:
print(df)
type(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

**Series** is a one-dimensional labeled array in pandas that can store data of a single type. It is often used to represent a single column or row of data in a DataFrame. Each element in a Series can be accessed using a label, which is its index.

In [29]:
# create a Series from a column of the DataFrame
age_series = df['Age']
print(age_series)
type(age_series)

0    25
1    30
2    27
Name: Age, dtype: int64

pandas.core.series.Series

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [56]:
data = {'Name': ['Alice', 'Bob', 'Claire', 'David', 'Emma', 'sunny', 'sandeep', 'jyothi', 'waseef', 'kiran'],
        'Grade': ['A', 'B', 'B', 'A', 'C', 'A', 'B', 'B', 'A', 'C'],
        'Score': [90, 80, 85, 92, 70, 90, 80, 85, 92, 70]}
df = pd.DataFrame(data)

In [43]:
# df.head() - returns the first n rows of the DataFrame (default n=5)
df.head()

     Name Grade  Score
0   Alice     A     90
1     Bob     B     80
2  Claire     B     85
3   David     A     92
4    Emma     C     70

In [41]:
# df.tail() - returns the last n rows of the DataFrame (default n=5)
df.tail()

      Name Grade  Score
5  sandeep     A     90
6  sandeep     B     80
7   jyothi     B     85
8   waseef     A     92
9    kiran     C     70

In [44]:
# df.describe() - provides descriptive statistics for numerical columns of the DataFrame
df.describe()

           Score
count  10.000000
mean   83.400000
std     8.315982
min    70.000000
25%    80.000000
50%    85.000000
75%    90.000000
max    92.000000

In [45]:
# df.info() - provides a summary of the DataFrame, including column data types and non-null values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Grade   10 non-null     object
 2   Score   10 non-null     int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [51]:
# df.columns - returns the column names of a dataframe
df.columns

Index(['Name', 'Grade', 'Score'], dtype='object')

In [49]:
# df.shape - returns the number of rows and columns in the DataFrame.
df.shape

(10, 3)

In [54]:
# df.dtypes - returns the data type of all the columns in a dataframe
df.dtypes

Name     object
Grade    object
Score     int64
dtype: object

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both **Series** and **DataFrame** are mutable in nature in pandas, while **Panel** has been deprecated and is no longer recommended for use in newer versions of pandas.

# Q7. Create a DataFrame using multiple Series. Explain with an example

In [58]:
names = pd.Series(['Alice', 'Bob', 'Claire'])
ages = pd.Series([25, 30, 27])
genders = pd.Series(['Female', 'Male', 'Female'])

# create a dictionary of Series
data = {'Name': names, 'Age': ages, 'Gender': genders}

# create a DataFrame using the dictionary of Series
df = pd.DataFrame(data)

# print the DataFrame
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female